rails_api/app/controllers/api/v1/questions_controller.rb

SELECT "stores".* FROM "stores" WHERE "stores"."shop_domain" = $1 LIMIT $2  [["shop_domain", "auto-shopai.myshopify.com"], ["LIMIT", 1]]
---
  def create
    store = Store.find_by(shop_domain: params[:store_id])